# 1. Першого дня спортсмен пробіг `x` кілометрів, а потім він щодня збільшував пробіг на 10% від попереднього
# значення. За цим числом `y` визначте номер дня, на який відстань спортсмена складе не менше `y` кілометрів.
# Програма отримує на вхід числа `x` та `y` і має вивести одне число - номер дня.

x = int(input('Ввведіть скільки спортсмен пробіг кілометрівв першого дня >>> '))
y = int(input('Введіть скільки кілометрівв спортсмен пробіг загалом >>> '))

day_km = []

while x <= y:
    x += x * 0.1
    day_km.append(x)

print(f'На {int(len(day_km))}-й день спортсмен пробіжить {y}км')