# 7. ** Дано два списки чисел. Надрукувати:
# - числа, що містяться одночасно як у першому списку, так і в другому
# - числа, що містяться в першому, але відсутні в другому
# - тільки унікальні для першого та другого списків
first_set = {1, 3, 5, 6, 7, 8, 9, 10, 44, 86, 25, 36, 15, 13}
second_set = {1, 2, 5, 7, 10, 15, 13, 72, 36,95, 66}
print(f'числа, що містяться одночасно як у першому списку, так і в другому >>> {first_set.intersection(second_set)}')
print(f'числа, що містяться в першому, але відсутні в другому >>> {first_set - second_set}')
print(f'Унікальні елементи для першого та другого списків >>> {first_set.difference(second_set)}')


