# 6. * Даний список чисел. Визначте, скільки в цьому списку елементів, які більше двох своїх сусідів (ліворуч і праворуч),
# та виведіть кількість таких елементів. Крайні елементи списку ніколи не враховуються, оскільки вони мають недостатньо
# сусідів.
list_a = [1, 4, 6, 7, 9, 4, 7, 5, 8, 5, 11]
numbers = []
for index in range(1, len(list_a)-1):
    if list_a[index] > list_a[index-1] and list_a[index] > list_a[index+1]:
        numbers.append(list_a[index])

print(numbers)
print(f'кількість номерів, які повторюються = {len(numbers)}')

