# 2. Програма запитує введення послідовності цілих невід'ємних чисел, доки не буде введено 0. Як тільки
# буде введено 0 (нуль), програма повинна порахувати та вивести на екран:
# - кількість введених чисел (завершальний 0 не рахується)
# - їхню суму
# - добуток
# - середнє арифметичне (крім завершального числа 0)
# - Визначити значення та порядковий номер найбільшого елемента послідовності. Якщо найбільших елементів є кілька,
# виведіть порядковий номер першого з них. Нумерація елементів починається з 1 (однини)
# - визначити кількість парних та непарних елементів у послідовності
# - Визначити значення другого за величиною елемента в цій послідовності
# - визначте, скільки елементів цієї послідовності дорівнюють її найбільшому елементу
list_x = []
while True:
    x_input = int(input('Введіть будь-яке невідємне число >>> '))

    if x_input == 0:
        break

    list_x.append(x_input)

print(f'Ми отримали список чисел: {list_x}')

# - кількість введених чисел (завершальний 0 не рахується)
print(f'Кількість введених чисел = {len(list_x)}')

# - їхню суму
sum_input = sum(list_x)
print(f'Сума введених чисел = {sum_input}')

# - середнє арифметичне (крім завершального числа 0)
print(f'Cереднє арифметичне (крім завершального числа 0) = {sum_input / len(list_x)}')

# - добуток
dobutok = 1
for elem in list_x:
    dobutok = dobutok * elem
print (f'добуток всіх елементів = {dobutok}')

# - визначити кількість парних та непарних елементів у послідовності
para = []
nepara = []
for elem in list_x:
    if elem % 2 == 0:
        para.append(elem)
    else:
        nepara.append(elem)
print(f'Кількість парних елементів = {len(para)}')
print(f'Кількість непарних елементів = {len(nepara)}')

# - Визначити значення другого за величиною елемента в цій послідовності
list_x.sort()
print(f'другий за величиною елемент в цій послідовності: {list_x[-2]}')

# - визначте, скільки елементів цієї послідовності дорівнюють її найбільшому елементу
minimal = []
for elem in list_x:
    if elem == list_x[0]:
        minimal.append(elem)
print(f'Кількість елементівв, які дорівнюють найменшому числу "{list_x[0]}" = {len(minimal)}')