# 5. Дано рядок.
#
# a. Виведіть третій символ цього рядка.
#   b. виведіть передостанній символ цього рядка.
#   с. виведіть перші п'ять символів цього рядка.
#   d. виведіть весь рядок, крім двох останніх символів.
#   e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи
#   з першого).
#   f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
#   g. виведіть усі символи у зворотному порядку.
#   h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
#   i. виведіть довжину цього рядка.

#word = input("Введіть якесь слово >>> ")
word = "12345678"

print(word[2])
print(word[-2])
print(word[:5])
print(word[:-2])
print(word[::2])
print(word[1:: 2])
print(word[::-1])
print(word[::-2])
print(len(word))