# 6. Програма отримує на вхід число х.
#   Даний список із 10 елементів [10, 20, 30, 40, 50, 60, 70, 80, 90, 100].
#   Написати програму яка поверне:
#   Чи є x серед елементів.
#   Число на введення може бути як цілим числом, числом з точкою, що плаває, так і від'ємним,
#   тобто. x = -10.00 має повернути що x є у списку.
#  ** В ідеалі список повинен бути записаний як кортеж один раз.

number = input('Введіть число >>> ')
number = float(number)
elements = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
elements = tuple(elements)
# Також кортедж можна записати таким чином:
# elements = tuple(range(10,101,10))
for x in range(len(elements)):
    if elements[x] == number or elements[x] == abs(number):
        print(f'Число {int(number)} є у списку')


