# 6. Шаховий кінь ходить буквою "Г" - на дві клітинки по вертикалі в будь-якому напрямку і на одну клітинку по горизонталі,
# чи навпаки. Дані дві різні клітини шахівниці, визначте, чи може кінь потрапити з першої клітини на другу одним ходом.
x1 = int(input('Введіть координати для x1 >>> '))
x2 = int(input('Введіть координати для x2 >>> '))
y1 = int(input('Введіть координати для y1 >>> '))
y2 = int(input('Введіть координати для y2 >>> '))
if abs(x1-x2) == 1 and abs(y1 - y2) == 2:
    print('YES')
elif abs(x1-x2) == 2 and abs(y1 - y2) == 1:
    print('Yes')
else:
    print('NO')