# 7. Написати програму, яка знайде факторіал введеного користувачем числа.
# Наприклад, факторіал числа 5 дорівнює добутку 1*2*3*4*5 = 120.
# Формула знаходження факторіалу:
 # n! = 1 * 2 * ... * n, де n - введене користувачем число.

number = int(input('Ведіть будь - яке число >>> '))
fact = 1
for x in range(2, number + 1):
    fact = fact * x
print(f'Факторіал числа {number} дорівнює {fact}')


# Спосіб №2:
number = int(input('Ведіть будь - яке число >>> '))
import math
print(f'Факторіал числа {number} дорівнює {math.factorial(number)}')

